{
  "test": "indonesia",

  "sidebar": {
    "about": "Tentang",
    "project": "Proyek",
    "skill": "Keterampilan",
    "light": "Terang",
    "dark": "Gelap",
    "theme": "Tema"
  },

  "about": {
    "title": "Tentang",
    "subTitle": "Tentang Saya",
    "text1": "Hai! Saya Aldy. Saya mulai belajar pengembangan web pada awal pandemi. Karena tidak banyak yang bisa dilakukan, saya memutuskan untuk memulai perjalanan pengembangan web saya melalui forum-forum pengembangan web. Setelah itu, saya mulai menonton berbagai video YouTube untuk mendalami pengembangan web, terutama dalam hal pengembangan frontend.",
    "text2": "Saya sangat ingin memperluas pengetahuan dan keterampilan saya dalam pengembangan frontend, karena ada begitu banyak teknologi dan konsep yang bisa dieksplorasi. Saya merasa sangat puas dalam proses memperoleh informasi dan teknik baru, dan saya sangat termotivasi untuk terus belajar dan berkembang. Saya menghargai umpan balik yang konstruktif karena itu membantu saya memperbaiki kemampuan saya dan meningkatkan keahlian saya secara keseluruhan.",
    "text3": "Melalui situs web ini, saya berencana untuk berbagi pemikiran dan memamerkan proyek-proyek yang telah saya kerjakan. Saya sangat percaya bahwa mendokumentasikan apa yang telah saya pelajari adalah metode yang sangat baik untuk memperkuat pemahaman saya, dan juga memungkinkan saya untuk berbagi pengetahuan saya dengan orang lain. Jangan ragu untuk menghubungi saya, dan saya akan senang membantu Anda!",
    "address": "Saya Tinggal Di",
    "education": "Pendidikan"
  },

  "footer": "Hubungi saya",

  "home": {
    "subTitle": "Pengenalan dan Perjalanan Karier Profesional.",
    "call": "Perkenalkan Saya",
    "experiences": "Pengalaman",
    "bio": "Bekerja dengan Vue Js & Laravel, mengubah ide menjadi realitas digital yang <br /> mudah diakses dan inklusif untuk pengguna web."
  },

  "project": {
    "subTitle": "Project Saya",
    "projects": {
      "description1": "TO DO project untuk tugas dari Super Bootcamp Sanbercode 2024.",
      "description2": "Back End aplikasi untuk Restful API themed E - Bengkel. Melayani admin untuk melakukan tugas administratif untuk workshop mereka.",
      "description3": "Proyek ini adalah tugas dari Sanbercode Bootcamp. Fungsi proyek ini untuk menampilkan tugas movie review.",
      "description4": "Project Fullstack saya tentang perpustakaan online yg berisikan web portal user sekaligus dashboard admin, user dapat meminjam ataupun membeli buku. Terdapat juga dashboard admin untuk  melakukan alktivitas pengelolaan dan pemantawan perpustakaan"
    }
  },

  "skills": {
    "subTitle": "Keterampilan Saya",
    "skill": "Keterampilan",
    "frontend": {
      "item1": "HTML & CSS: Membuat halaman web yang responsif dan ramah pengguna dengan markup modern dan semantik.",
      "item2": "JavaScript & TypeScript: Membangun antarmuka pengguna yang dinamis dan interaktif.",
      "item3": "Frameworks: Mahir dalam Vue.js untuk membuat aplikasi web yang efisien, mudah dipelihara, dan skalabel."
    },
    "backend": {
      "item1": "Laravel: Mengembangkan aplikasi sisi server yang cepat dan skalabel.",
      "item2": "Manajemen Database: Terampil dalam database SQL seperti MySQL."
    },
    "design": {
      "title": "Desain",
      "item1": "Bootstrap: Menggunakan Bootstrap untuk membuat desain web yang responsif dan mobile-first.",
      "item2": "Tailwind CSS: Menggunakan framework CSS utilitas-pertama untuk dengan cepat membangun desain kustom."
    },
    "tools": {
      "title": "Alat & Teknologi",
      "item1": "Kontrol Versi: Terampil dengan Git dan GitHub untuk manajemen kode sumber dan kolaborasi.",
      "item2": "Alat Bangun: Pengalaman dengan Webpack, Babel, dan npm/yarn untuk manajemen proyek yang efisien.",
      "item3": "Pengujian: Menulis dan menjalankan tes menggunakan framework seperti Jest dan Cypress untuk memastikan kualitas kode."
    },
    "additional": {
      "title": "Kemampuan Tambahan",
      "item1": "Pemecahan Masalah: Keterampilan analitis dan pemecahan masalah yang kuat untuk menangani tantangan kompleks secara efektif."
    }
  },

  "ibb-admin": {
    "subTitle": "Proyek saya di PT. Sarana Pactindo",
    "summary": "Sebagai Front-end Developer, saya berpartisipasi dalam pengembangan aplikasi admin untuk Bank Mandiri Taspen KALSEL Ibb Admin. Bekerja sama dengan dua anggota tim lainnya, saya bertanggung jawab mengimplementasikan berbagai fitur yang diperintahkan melalui dokumentasi",
    "desc": "IBB Admin adalah aplikasi web admin yang digunakan oleh Bank Mandiri Taspen KALSEL untuk mengelola berbagai aktivitas internal perusahaan. Aplikasi ini dirancang untuk meningkatkan efisiensi operasional, membantu dalam pengambilan keputusan, serta memudahkan pengelolaan data dalam organisasi.",
    "desc1": "IBB Admin adalah aplikasi web admin yang digunakan oleh Bank Mandiri Taspen KALSEL untuk mengelola berbagai aktivitas internal perusahaan.",
    "feature": "Fitur",

    "features": {
      "item1": "Mengimplementasikan fitur login dengan dukungan terjemahan (bahasa Indonesia dan Inggris)",
      "item2": "Membangun dashboard interaktif dengan visualisasi data perusahaan",
      "item3": "Mengimplementasikan fitur CRUD untuk daftar perusahaan, memungkinkan pengelolaan data perusahaan secara efisien.",
      "item4": "Menerapkan fitur penerimaan dan penerimaan hari libur kepada seluruh karyawan",
      "item5": "Mengimplementasikan fitur CRUD gambar banner untuk carousel pada halaman web lain, memberikan fleksibilitas dalam pengelolaan konten promosi."
    },
    "alert": "Proyek ini bukan untuk publik. Itu hanya untuk internal.",
    "tools": "Alat dan Teknologi"
  },

  "ibb-va": {
    "subTitle": "Proyek saya di PT. Sarana Pactindo",
    "summary": "Sebagai Front-end Developer, saya berpartisipasi dalam pengembangan aplikasi daftar virtualaccount pada bank Mandiri Taspen KALSEL, Aplikasi ini dirancang untuk membantu pengelolaan transaksi dan data perusahaan dengan lebih efisien",
    "desc": "Aplikasi ini dirancang untuk membantu pengelolaan transaksi dan data perusahaan dengan lebih efisien. Aplikasi ini ditujukan untuk Bank Mandiri Taspen KALSEL.",
    "feature": "Fitur",

    "features": {
      "item1": "Mengimplementasikan fitur login dengan dukungan terjemahan (bahasa Indonesia dan Inggris)",
      "item2": "Membangun dashboard interaktif dengan visualisasi chart yang efektif, membantu pengguna dalam menganalisis data dengan cepat.",
      "item3": "Memasukan data laporan pemasukan DANA ke tabel yg interaktif",
      "item4": "Mengimplementasikan fitur filter transaksi, memungkinkan pengguna untuk mencari danmenyaring data dengan mudah.",
      "item5": "Menyediakan fitur ekspor dan unduh data dalam format EXCEL dan PDF, memudahkanpengguna dalam memproses dan menyimpan laporan."
    },
    "alert": "This project is not for public use. It is only for internal use.",
    "tools": "Tools & Tech",
    "output": "Hasil",
    "outputs": {
      "item1": "Berhasil mengimplementasikan semua API yang ditugaskan, memastikan integrasi backenddan frontend berjalan lancar.",
      "item2": "Membangun tampilan yang responsif dan rapi, memberikan pengalaman pengguna yangoptimal di berbagai perangkat.",
      "item3": "Kolaborasi tim yang efektif dan positif, yang memungkinkan proyek diselesaikan tepat waktudengan hasil yang memuaskan."
    }
  },

  "button": {
    "back": "Kembali"
  }
}
